OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
        if(Enable4ByteFlag)
            MSG_DEBUG("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

        usiEraseSector(offset, 1);
        usiWrite(offset, SPI_BLOCK_SIZE, (UINT8 *)spiSourceAddr);

        spiSourceAddr += SPI_BLOCK_SIZE;
        offset += SPI_BLOCK_SIZE;

        //ack status
        tmplen += SPI_BLOCK_SIZE;
        SendAck((tmplen * 95) / len);
    }
    if ((len % (SPI_BLOCK_SIZE)) != 0)
    {
        MSG_DEBUG("remin Burn_SPI  offset=0x%x(%d)\n", offset, offset);
        // 4Byte Address Mode (>16MByte)
        Enable4ByteFlag = 0;
        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;
        if(offset > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;

        if(Enable4ByteFlag)
            MSG_DEBUG("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

        len = len - blockCount*SPI_BLOCK_SIZE;
        usiEraseSector(offset, 1);
        usiWrite(offset, len, (UINT8 *)spiSourceAddr);
    }
    //ack status
    SendAck(100);

    return 0;
}

int BatchBurn_SPI(UINT32 len,UINT32 imageoffset)
{
    int volatile tmplen=0;
    int i, offset=0, blockCount, total, remainlen;
    uint32_t spiSourceAddr, reclen;
    unsigned char buf[80];
    unsigned char *ptr;
    unsigned char *_ch;
    unsigned int *_ack;

    MSG_DEBUG("BatchBurn_SPI: Enable4ByteFlag=%d len=%d(0x%x)     imageoffset= %d(0x%x)\n", Enable4ByteFlag, len, len, imageoffset, imageoffset);
    /* set up interface */
    if (usiInit() == Fail)
    {
        SendAck(0xFFFFFFFF);
        return Fail;
    }

    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    ptr=_ch;
    spiSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
    //len = (pSpiImage->fileLength+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize);
    blockCount = len / SPI_BLOCK_SIZE;
    total = len;
    offset = imageoffset;
    MSG_DEBUG("fileLength=%d, len=%d, blockCount=%d\n", pSpiImage->fileLength, len, blockCount);
    for (i=0; i<blockCount; i++)
    {
        ptr=_ch;
        spiSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
        remainlen=MIN(total, SPI_BLOCK_SIZE);
        do
        {
            if(Bulk_Out_Transfer_Size>0)
            {
                MSG_DEBUG("total=%08d,remainlen=%08d\n",total,remainlen);
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while(remainlen!=0);

        MSG_DEBUG("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
        Enable4ByteFlag = 0;
        // 4Byte Address Mode (>16MByte)
        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;
        if(len > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;

        if(Enable4ByteFlag)
            MSG_DEBUG("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

        usiEraseSector(offset, 1);
        usiWrite(offset, SPI_BLOCK_SIZE, (UINT8 *)spiSourceAddr);

        spiSourceAddr += SPI_BLOCK_SIZE;
        offset += SPI_BLOCK_SIZE;

        //ack status
        SendAck(i);//send ack(blockcount) to PC
    }

    tmplen = len % (SPI_BLOCK_SIZE);
    if (tmplen != 0)
    {
        MSG_DEBUG("tmplen=0x%x(%d)\n", tmplen, tmplen);
        ptr=_ch;
        spiSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
        remainlen=MIN(tmplen, SPI_BLOCK_SIZE);
        do
        {
            if(Bulk_Out_Transfer_Size>0)
            {
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
                MSG_DEBUG("total=%08d,remainlen=%08d\n",total,remainlen);
            }
        }
        while(remainlen!=0);

        // 4Byte Address Mode (>16MByte)
        Enable4ByteFlag = 0;
        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;
        if(offset > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;

        if(Enable4ByteFlag)
            printf("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

        len = tmplen;
        usiEraseSector(offset, 1);
        usiWrite(offset, len, (UINT8 *)spiSourceAddr);

        //ack status
        SendAck(100); //done
    }


    return 0;
}

void UXmodem_SPI(void)
{
    int len,i,j;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int offset=0, tempoffset = 0;
    unsigned int remain, ddrlen;
    PACK_CHILD_HEAD ppack;
    unsigned int ret;
    int volatile tmplen=0;
    int blockCount,remainlen, reclen, total;
    uint32_t spiSourceAddr;

    MSG_DEBUG("download image to SPI flash...\n");
    memset((char *)&spiImage, 0, sizeof(FW_NOR_IMAGE_T));
    pSpiImage = (FW_NOR_IMAGE_T *)&spiImage;
    usiInit();  //Init SPI
    MSG_DEBUG("UXmodem_SPI\n");
    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;

    while(1)
    {
        if(Bulk_Out_Transfer_Size>0)
        {
            usb_recv(ptr,sizeof(FW_NOR_IMAGE_T));
            memcpy(pSpiImage,(unsigned char *)ptr,sizeof(FW_NOR_IMAGE_T));
            break;
        }
    }

    MSG_DEBUG("Action flag: %s, image %d, len=%d exec=0x%08x type=%d",
              au8ActionFlagName[pSpiImage->actionFlag], pSpiImage->imageNo,pSpiImage->fileLength,pSpiImage->executeAddr,pSpiImage->imageType);
    usiInit();
    spiNorReset();
    MSG_DEBUG("  Enable4ByteFlag=%d\n",Enable4ByteFlag);
    switch(pSpiImage->actionFlag)
    {
    case WRITER_MODE:   // normal write
    {
        MSG_DEBUG("SPI normal write !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        //image size = DDR size – 1M - 64k
        if (pSpiImage->imageType == UBOOT) // uboot image
        {
            pSpiImage->imageNo = 0;
            pSpiImage->flashOffset = 0;
            addMagicHeader(pSpiImage->executeAddr, pSpiImage->fileLength);
            addNUC980MagicHeader(1);
            ptr += IBR_HEADER_LEN; // except the 32 bytes magic header
            offset = IBR_HEADER_LEN;

            do
            {
                if(Bulk_Out_Transfer_Size>0)
                {

                    len=Bulk_Out_Transfer_Size;
                    usb_recv(ptr,len);  //recv data from PC
                    ptr+=len;
                    *_ack=len;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                }
            }
            while((ptr-_ch)<(pSpiImage->fileLength+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize));
            Burn_SPI(pSpiImage->fileLength+(((FW_NOR_IMAGE_T *)pSpiImage)->initSize)+offset,pSpiImage->flashOffset);
            MSG_DEBUG("uBOOT  len=%d, fileLength=%d, IBR_HEADER_LEN=%d, ddrlen=%d\n", pSpiImage->fileLength+(((FW_NOR_IMAGE_T *)pSpiImage)->initSize)+offset, pSpiImage->fileLength, offset, (((FW_NOR_IMAGE_T *)pSpiImage)->initSize));
        }
        else // BATCH_BRUN
        {
            offset=0;
            MSG_DEBUG("len=%d, fileLength=%d, IBR_HEADER_LEN=%d, ddrlen=%d\n", pSpiImage->fileLength+(((FW_NOR_IMAGE_T *)pSpiImage)->initSize)+offset, pSpiImage->fileLength, offset, (((FW_NOR_IMAGE_T *)pSpiImage)->initSize));
            BatchBurn_SPI(pSpiImage->fileLength+(((FW_NOR_IMAGE_T *)pSpiImage)->initSize)+offset,pSpiImage->flashOffset);
        }
    }
    break;

