OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    case MODIFY_MODE:   // modify
    {
        MSG_DEBUG("SPI modify !!!\n");
        {
            int state;
            state = ChangeSpiImageType(pSpiImage->imageNo, pSpiImage->imageType);
            if (state < 0)
            {
                //MSG_DEBUG("error!!\n");
                SendAck(0xFFFFFFFF);
            }
            else
            {
                //MSG_DEBUG("OK!!\n");
                SendAck(100);
            }
        }
    }
    break;

    case ERASE_MODE:   // erase
    {
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("SPI erase !!! imageNo=%d\n",pSpiImage->imageNo);
        MSG_DEBUG("\nstart=%d\n",pSpiImage->flashOffset); //start block
        MSG_DEBUG("length=%d\n",pSpiImage->executeAddr);  //block length
        MSG_DEBUG("type=%d\n",pSpiImage->imageType);      //0: chip erase, 1: erase accord start and length blocks.
        MSG_DEBUG("type=0x%08x\n",pSpiImage->imageNo);

        if (pSpiImage->imageNo != 0xFFFFFFFF)
            DelSpiSector(pSpiImage->flashOffset,pSpiImage->executeAddr);
        else
        {
            // erase all
            ret = usiEraseAll();
            if(ret == 0)
            {
                MSG_DEBUG("erase all done \n");
                //SendAck(100);
            }
            else
            {
                MSG_DEBUG("Error erase all fail \n");
                //SendAck(0xffffff);
            }
        }
    }
    break;

    case VERIFY_MODE: // verify
    {
        MSG_DEBUG("SPI normal verify !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4); //send ack to PC
        }

        if (pSpiImage->imageType == UBOOT) // uboot image, image size = DDR size – 1M - 64k
        {
            _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
            ptr=_ch;
            MSG_DEBUG("UBOOT verify offset=%d,flashOffset=%d,fileLength=%d\n",offset,pSpiImage->flashOffset,pSpiImage->fileLength);
            memset(ptr, 0, pSpiImage->fileLength);
            offset=32;
            len =  pSpiImage->fileLength;
            do
            {
                tempoffset = 0;
                remainlen=MIN(len, TRANSFER_LEN);
                //4Byte Address Mode (>16MByte)
                Enable4ByteFlag = 0;
                if((pSpiImage->flashOffset + offset + remainlen) > SPI_FLASH_SIZE)
                    Enable4ByteFlag = 1;

                if(Enable4ByteFlag)
                    MSG_DEBUG("VERIFY_MODE  Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                usiRead(pSpiImage->flashOffset+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, remainlen, ptr);//(UINT8 *)(DOWNLOAD_BASE));

                usb_send(ptr,remainlen); //send data to PC
                while(Bulk_Out_Transfer_Size==0) {}
                usb_recv((unsigned char*)_ack,4);   //recv data from PC

                if(*_ack==0)
                    break;
                else
                {
                    offset+=(*_ack);
                    len -= remainlen;
                }
                MSG_DEBUG("SPI VERIFY_MODE: pSpiImage->fileLength=%d  offset=0x%08x(%d)   len= 0x%08x(%d)\n", pSpiImage->fileLength, offset, offset, len, len);
            }while(len>0);
        }
        else // Batch verify
        {
            offset=0;
            _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
            blockCount = pSpiImage->fileLength / SPI_BLOCK_SIZE;
            for(i=0; i<blockCount; i++)
            {
                ptr=_ch;
                memset(ptr, 0, SPI_BLOCK_SIZE);
                tempoffset = SPI_BLOCK_SIZE;
                do
                {
                    //4Byte Address Mode (>16MByte)
                    Enable4ByteFlag = 0;
                    if((pSpiImage->flashOffset + offset + TRANSFER_LEN) > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;

                    if(Enable4ByteFlag)
                        MSG_DEBUG("VERIFY_MODE  Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                    if (pSpiImage->flashOffset == 0)
                        usiRead(pSpiImage->flashOffset+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, TRANSFER_LEN, ptr);
                    else
                        usiRead(pSpiImage->flashOffset+offset, TRANSFER_LEN, ptr);

                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC

                    if(*_ack==0)
                        break;
                    else
                    {
                        offset+=(*_ack);
                        tempoffset-=(*_ack);
                    }
                }while(tempoffset>0);
                MSG_DEBUG("SPI VERIFY_MODE: i=%d, pSpiImage->fileLength=%d  offset=0x%08x(%d)   tempoffset= 0x%08x(%d)\n", i, pSpiImage->fileLength, offset, offset, tempoffset, tempoffset);
            }

            tmplen = pSpiImage->fileLength % (SPI_BLOCK_SIZE);
            MSG_DEBUG("tmplen: pSpiImage->fileLength=%d  offset=0x%08x(%d)   tmplen= %d\n", pSpiImage->fileLength, offset, offset, tmplen);
            if (tmplen != 0)
            {
                ptr=_ch;
                memset(ptr, 0, SPI_BLOCK_SIZE);
                tempoffset = tmplen;
                do
                {
                    reclen=MIN(TRANSFER_LEN,tmplen);

                    //4Byte Address Mode (>16MByte)
                    Enable4ByteFlag = 0;
                    if((pSpiImage->flashOffset + offset + reclen) > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;

