OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
                    if(Enable4ByteFlag)
                        MSG_DEBUG("VERIFY_MODE  Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                    if (pSpiImage->flashOffset == 0)
                        usiRead(pSpiImage->flashOffset+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, reclen, ptr);
                    else
                        usiRead(pSpiImage->flashOffset+offset, reclen, ptr);

                    usb_send(ptr,reclen); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC

                    if(*_ack==0)
                        break;
                    else
                    {
                        tmplen-=(*_ack);
                        offset+=(*_ack);
                        tempoffset -=(*_ack);
                    }

                }while(tempoffset>0);

            }

        }
    }
    break;
    case PACK_VERIFY_MODE: // Mass production verify
    {
        MSG_DEBUG("\n SPI PACK verify !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        MSG_DEBUG("pSpiImage->imageNo=%d,flashOffset=%d,fileLength=%d\n",pSpiImage->imageNo,pSpiImage->flashOffset,pSpiImage->fileLength);

#if(0) //image size = DDR size – 1M - 64k
        memset(ptr, 0, pSpiImage->fileLength);
#else // PACK Batch Verify
        memset(ptr, 0, SPI_BLOCK_SIZE);
#endif

        offset=0;
        for(i=0; i<pSpiImage->imageNo; i++)
        {
            while(1)
            {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD))
                {
                    usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                    memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                    usleep(1000);
                    *_ack=0x85;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }

#if(0) //image size = DDR size – 1M - 64k
            pSpiImage->fileLength = ppack.filelen;
            pSpiImage->flashOffset = ppack.startaddr;
            offset = 0;
            MSG_DEBUG("imageNum = %d, offset=0x%x, flashOffset=0x%x, fileLength=0x%x\n",i, offset,pSpiImage->flashOffset,pSpiImage->fileLength);
            // Get DDR parameter length
            if (ppack.imagetype == UBOOT)  // system image
            {
                usb_recv(ptr,4);
                memcpy(&ddrlen,(unsigned char *)ptr,4);
                MSG_DEBUG("ddrlen = %d\n", ddrlen);
                //usleep(1000);
                *_ack=0x85;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }

            //MSG_DEBUG("=======> imageNo=%d, pSpiImage->flashOffset =0x%x [%d]\n",i, pSpiImage->flashOffset, pSpiImage->flashOffset);
            do
            {
                //4Byte Address Mode (>16MByte)
                Enable4ByteFlag = 0;
                if(pSpiImage->fileLength > SPI_FLASH_SIZE)
                    Enable4ByteFlag = 1;
                if((pSpiImage->flashOffset + offset + TRANSFER_LEN) > SPI_FLASH_SIZE)
                    Enable4ByteFlag = 1;

                if(Enable4ByteFlag)
                    MSG_DEBUG("PACK_VERIFY_MODE  Enable4ByteFlag %d:  pSpiImage->flashOffset=0x%08x(%d)  offset=0x%08x(%d)\n", Enable4ByteFlag, pSpiImage->flashOffset, pSpiImage->flashOffset, offset, offset);

                if (offset == 0)
                {
                    if (ppack.imagetype == UBOOT)     // system image
                    {
                        pSpiImage->fileLength = pSpiImage->fileLength - IBR_HEADER_LEN - ddrlen;
                        usiRead(pSpiImage->flashOffset+IBR_HEADER_LEN+ddrlen+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
                    }
                    else
                    {
                        usiRead(pSpiImage->flashOffset+offset, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
                    }
                }
                else
                {
                    if (ppack.imagetype == UBOOT)     // system image
                    {
                        usiRead(pSpiImage->flashOffset+IBR_HEADER_LEN+ddrlen+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
                    }
                    else
                    {
                        usiRead(pSpiImage->flashOffset+offset, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
                    }
                }

                usb_send(ptr,TRANSFER_LEN); //send data to PC
                while(Bulk_Out_Transfer_Size==0) {}
                usb_recv((unsigned char*)_ack,4);   //recv data from PC
                if(*_ack==0)
                    break;
                else
                    offset+=(*_ack);
            }while(offset<pSpiImage->fileLength);

#else // PACK Batch Verify

            pSpiImage->fileLength = ppack.filelen;
            pSpiImage->flashOffset = ppack.startaddr;
            _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
            blockCount = pSpiImage->fileLength / (SPI_BLOCK_SIZE);
            offset = 0;
            MSG_DEBUG("imageNum = %d, blockCount=0x%x, flashOffset=0x%x, fileLength=0x%x\n",i, blockCount,pSpiImage->flashOffset,pSpiImage->fileLength);
            // Get DDR parameter length
            if (ppack.imagetype == UBOOT)     // system image
            {
                usb_recv(ptr,4);
                memcpy(&ddrlen,(unsigned char *)ptr,4);
                MSG_DEBUG("ddrlen = %d\n", ddrlen);
                //usleep(1000);
                *_ack=0x85;
                usb_send((unsigned char*)_ack,4);//send ack to PC
                pSpiImage->fileLength = pSpiImage->fileLength - IBR_HEADER_LEN - ddrlen;
            }

