OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
            for(j=0; j<blockCount; j++)
            {
                ptr=_ch;
                memset(ptr, 0, SPI_BLOCK_SIZE);
                tempoffset = SPI_BLOCK_SIZE;
                do
                {
                    //4Byte Address Mode (>16MByte)
                    Enable4ByteFlag = 0;
                    if(pSpiImage->fileLength > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;
                    if((pSpiImage->flashOffset + offset + TRANSFER_LEN) > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;

                    if(Enable4ByteFlag)
                        MSG_DEBUG("PACK_VERIFY_MODE  Enable4ByteFlag %d:  pSpiImage->flashOffset=0x%08x(%d)  offset=0x%08x(%d)\n", Enable4ByteFlag, pSpiImage->flashOffset, pSpiImage->flashOffset, offset, offset);

                    if (offset == 0)
                    {
                        if (ppack.imagetype == UBOOT)     // system image
                        {
                            usiRead(pSpiImage->flashOffset+IBR_HEADER_LEN+ddrlen+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
                        }
                        else
                        {
                            usiRead(pSpiImage->flashOffset+offset, TRANSFER_LEN, ptr);
                        }
                    }
                    else
                    {
                        if (ppack.imagetype == UBOOT)     // system image
                        {
                            usiRead(pSpiImage->flashOffset+IBR_HEADER_LEN+ddrlen+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
                        }
                        else
                        {
                            usiRead(pSpiImage->flashOffset+offset, TRANSFER_LEN, ptr);
                        }
                    }
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC

                    if(*_ack==0)
                        break;
                    else
                    {
                        offset+=(*_ack);
                        tempoffset-=(*_ack);
                    }
                }while(tempoffset>0);
                MSG_DEBUG("SPI PACK_VERIFY_MODE: i=%d, pSpiImage->fileLength=%d  offset=0x%08x(%d)   tempoffset= 0x%08x(%d)\n", i, pSpiImage->fileLength, offset, offset, tempoffset, tempoffset);
            }

            tmplen = pSpiImage->fileLength % (SPI_BLOCK_SIZE);
            MSG_DEBUG("tmplen: pSpiImage->fileLength=0x%08x(%d)  offset=0x%08x(%d)   tmplen= %d\n", pSpiImage->fileLength, pSpiImage->fileLength, offset, offset, tmplen);
            if (tmplen > 0)
            {
                ptr=_ch;
                tempoffset = tmplen;
                do
                {
                    reclen=MIN(TRANSFER_LEN,tmplen);

                    //4Byte Address Mode (>16MByte)
                    Enable4ByteFlag = 0;
                    if((pSpiImage->flashOffset + offset + reclen) > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;

                    if(Enable4ByteFlag)
                        MSG_DEBUG("PACK_VERIFY_MODE  Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                    if (ppack.imagetype == UBOOT)     // system image
                    {
                        pSpiImage->fileLength = pSpiImage->fileLength - IBR_HEADER_LEN - ddrlen;
                        usiRead(pSpiImage->flashOffset+IBR_HEADER_LEN+ddrlen+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, reclen, ptr);
                    }
                    else
                    {
                        usiRead(pSpiImage->flashOffset+offset, reclen, ptr);
                    }
                    usb_send(ptr,reclen); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC

                    if(*_ack==0)
                        break;
                    else
                    {
                        tmplen-=(*_ack);
                        offset+=(*_ack);
                        tempoffset -=(*_ack);
                    }
                }while(tempoffset>0);
            }
#endif
        }
    }
    break;
    case READ_MODE: // read
    {
        MSG_DEBUG("SPI normal read !!!\n");
        MSG_DEBUG("offset=%d,flashOffset=%d,fileLength=%d\n",offset,pSpiImage->flashOffset,pSpiImage->fileLength);
        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }


        remain=pSpiImage->fileLength;
        offset=pSpiImage->flashOffset;
        while(TRANSFER_LEN<remain)
        {

            Enable4ByteFlag = 0;
            if((offset + TRANSFER_LEN) > SPI_FLASH_SIZE)
                Enable4ByteFlag = 1;

            if(Enable4ByteFlag)
                MSG_DEBUG("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);
            memset(ptr, 0, TRANSFER_LEN);
            usiRead(offset, TRANSFER_LEN , ptr);
            usb_send(ptr,TRANSFER_LEN); //send data to PC
            while(Bulk_Out_Transfer_Size==0) {}
            usb_recv((unsigned char*)_ack,4);   //recv data from PC
            remain-=TRANSFER_LEN;
            offset+=TRANSFER_LEN;
        }

        if(remain>0)
        {
            //4Byte Address Mode (>16MByte)
            Enable4ByteFlag = 0;
            if((offset + TRANSFER_LEN) > SPI_FLASH_SIZE)
                Enable4ByteFlag = 1;

            if(Enable4ByteFlag)
                MSG_DEBUG("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);
            memset(ptr, 0, TRANSFER_LEN);
            usiRead(offset, remain , ptr);
            usb_send(ptr,TRANSFER_LEN); //send data to PC
            while(Bulk_Out_Transfer_Size==0) {}
            usb_recv((unsigned char*)_ack,4);   //recv data from PC
        }
    }
    break;
    case PACK_MODE:
    {
        MSG_DEBUG("SPI pack mode !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        {
            PACK_HEAD pack;
            PACK_CHILD_HEAD ppack;
            while(1)
            {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_HEAD))
                {
                    usb_recv(ptr,sizeof(PACK_HEAD));
                    memcpy(&pack,(unsigned char *)ptr,sizeof(PACK_HEAD));
                    *_ack=sizeof(PACK_CHILD_HEAD);
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }
            MSG_DEBUG("pack.actionFlag=0x%x, pack.fileLength=0x%08x pack.num=%d!!!\n",pack.actionFlag,pack.fileLength,pack.num);
#if(0) //image size = DDR size - 1M - 64k
            for(i=0; i<pack.num; i++)
            {
                while(1)
                {
                    if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD))
                    {
                        usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                        memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                        break;
                    }
                }

                MSG_DEBUG("ppack.filelen=0x%x, ppack.startaddr=0x%08x!!!\n",ppack.filelen,ppack.startaddr);
                ptr=_ch;
                do
                {
                    if(Bulk_Out_Transfer_Size>0)
                    {
                        len=Bulk_Out_Transfer_Size;
                        usb_recv(ptr,len);  //recv data from PC
                        ptr+=len;
                        *_ack=len;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                    }
                }
                while((ptr-_ch)<ppack.filelen);
                if(ppack.imagetype!=PARTITION)
                {
                    Burn_SPI(ppack.filelen,((ppack.startaddr+SPI_BLOCK_SIZE-1)/SPI_BLOCK_SIZE)*SPI_BLOCK_SIZE);
                }
            }
#else // PACK BATCH_BRUN

            for(i=0; i<pack.num; i++)
            {
                MSG_DEBUG("ppack.filelen=0x%x, ppack.startaddr=0x%08x!!!\n",ppack.filelen,ppack.startaddr);
                ptr=_ch;
                while(1)
                {
                    if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD))
                    {
                        usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                        memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                        break;
                    }
                }

                spiSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
                len = ppack.filelen;
                blockCount = len / SPI_BLOCK_SIZE;
                total = len;
                offset = ((ppack.startaddr+SPI_BLOCK_SIZE-1)/SPI_BLOCK_SIZE)*SPI_BLOCK_SIZE;
                MSG_DEBUG("fileLength=%d, len=%d, blockCount=%d  offset=0x%x\n", ppack.filelen, len, blockCount, offset);

                if(ppack.imagetype!=PARTITION)
                {
                    BatchBurn_SPI(len, offset);
                }
            }

