OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
        }
#endif
    }
    break;
    default:
        ;
    }
    MSG_DEBUG("finish SPI flash image download\n");
}

extern void fw_dtbfunc(int,int,int,int);
int Run_SDRAM(UINT32 address,UINT32 offset,UINT32 tmpAddr,UINT32 dtbEn,UINT32 dtbAddr)
{
    unsigned int i;
    int volatile status = 0;
    unsigned int volatile u32PowerOn;
    void    (*fw_func)(int, int, int);
    fw_func = (void(*)(int, int, int))address;

    /* Disable all interrupts */
    sysSetGlobalInterrupt(DISABLE_ALL_INTERRUPTS);
    sysSetLocalInterrupt(DISABLE_FIQ_IRQ);

    sysFlushCache(I_D_CACHE);
//  outpw(REG_USBD_PHY_CTL, inpw(REG_USBD_PHY_CTL) & ~0x200);    // offset 0x704

    outpw(REG_SYS_AHBIPRST,1<<19);  //USBD reset
    outpw(REG_SYS_AHBIPRST,0<<19);
    outpw(REG_USBD_PHYCTL, inpw(REG_USBD_PHYCTL) & ~0x100);
    outpw(REG_CLK_HCLKEN, inpw(REG_CLK_HCLKEN) & ~0x80000);

    MSG_DEBUG("run ... %x\n", address);

    SYS_UnlockReg();
    outpw(REG_CLK_HCLKEN, 0x00004527);
    outpw(REG_CLK_PCLKEN0, 0);
    outpw(REG_CLK_PCLKEN1, 0);
    outpw(REG_CLK_DIVCTL3, 0);//Reset SD0 Clock Source and Divider
    outpw(REG_CLK_DIVCTL9, 0);//Reset SD1 Clock Source and Divider
    outpw(REG_WDT_CTL, (inpw(REG_WDT_CTL) & ~(0xf << 8))|(0x6<<8));// Default WDT timeout 2^16 * (12M/512) = 2.79 sec
    MSG_DEBUG("SRAM WDT: 0x08%x/0x08%x/0x08%x\n",inpw(REG_WDT_CTL),inpw(REG_WDT_ALTCTL),inpw(REG_WDT_RSTCNT));
    u32PowerOn = inpw(REG_SYS_PWRON);
    if(((u32PowerOn&0x10) >> 4))   //PG[15:11] used as JTAG interface
    {
        for(i=(unsigned int)REG_SYS_GPA_MFPL; i<=(unsigned int)REG_SYS_GPG_MFPH; i+=4)
        {
            if(i == REG_SYS_GPG_MFPH)
            {
                outpw(i,inpw(REG_SYS_GPG_MFPH)& ~0x00000FFF);
                //printf("inpw(REG_SYS_GPG_MFPH) = 0x%x\n", inpw(REG_SYS_GPG_MFPH));
                continue;
            }
            else
                outpw(i,0x00);
        }
    }
    else     //PA[6:2] used as JTAG interface
    {
        for(i=(unsigned int)REG_SYS_GPA_MFPL; i<=(unsigned int)REG_SYS_GPG_MFPH; i+=4)
        {
            if(i == REG_SYS_GPA_MFPL)
            {
                outpw(i,inpw(REG_SYS_GPA_MFPL)& ~0xF00000FF);
                //printf("inpw(REG_SYS_GPA_MFPL) = 0x%x\n", inpw(REG_SYS_GPA_MFPL));
                continue;
            }
            else
                outpw(i,0x00);
        }
    }

    SYS_LockReg();

    if(address<offset)
        memcpy((unsigned char *)address,(unsigned char *)tmpAddr,offset);

    if(dtbEn==1)
        fw_dtbfunc(0,0,dtbAddr,address);
    else
        fw_func(0, ChipID, 0x100);
    return status;
}

void UXmodem_SDRAM(void)
{
    unsigned int fileAddr=0, dtbAddr=0, fileSize=0, exeFlag=0, dtbFlag=0;//actionFlag=0
    int len, debuglen = 0;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;

    int Otag;
    unsigned int offset=0x40;
    unsigned int tmpAddr=((EXEADDR-0x100000)-offset); // 62M

    MSG_DEBUG("download image to SDRAM...\n");

    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;

    while(1)
    {
        if(Bulk_Out_Transfer_Size>0)
        {
            usb_recv(ptr,16);

            //actionFlag=*((unsigned int*)ptr);
            fileSize=*((unsigned int*)(ptr+4));
            fileAddr=*((unsigned int*)(ptr+8));
            dtbAddr=*((unsigned int*)(ptr+12));
            break;
        }
    }

    /* for debug or delay */
    {
        *_ack=0x80;
        usb_send((unsigned char*)_ack,4);//send ack to PC
    }

    MSG_DEBUG("action flag %d, address 0x%x, len %d, dtbAddr 0x%x\n", actionFlag, fileAddr, fileSize, dtbAddr);
    /* check if the image need execute */
    if (fileAddr & 0x80000000)
    {
        exeFlag = 1;
        fileAddr = fileAddr & 0x7FFFFFFF;
    }

    if (dtbAddr & 0x80000000)
    {
        dtbFlag = 1;
        dtbAddr = dtbAddr & 0x7FFFFFFF;
    }

    _ch=((unsigned char*)(((unsigned int)fileAddr | NON_CACHE)));
    if(fileAddr<offset && exeFlag == 1)
    {
        Otag=1;
        ptr=_ch+offset;
    }
    else
    {
        Otag=0;
        ptr=_ch;
    }
    MSG_DEBUG("Otag=%d,  0x%x\n", Otag, ptr);
    do
    {
        if(Bulk_Out_Transfer_Size>0)
        {
            len=Bulk_Out_Transfer_Size;
            usb_recv(ptr,len);  //recv data from PC
            if(Otag==1)
            {
                memcpy((unsigned char *)tmpAddr,ptr,offset);
                memcpy(ptr,ptr+offset,len-offset);
                ptr+=(len-offset);
                Otag=0;
            }
            else
            {
                ptr+=len;
            }
            *_ack=len;
            usb_send((unsigned char*)_ack,4);//send ack to PC
            debuglen+=len;
            //printf("ptr-_ch =0x%x, debugcnt = %d, debuglen =%d\n", (ptr-_ch), debugcnt++, debuglen);
        }

    }
    while((ptr-_ch)<fileSize);

    printf("\nfinish SDRAM download ...\n");

    if (exeFlag == 1)   /* execute image */
    {

#ifdef MSG_DEBUG_EN
        MSG_DEBUG("execute image ...\n");
#else
        ETIMER_Delay(0, 100); /* Waiting for application recevie ack */
#endif

        if(dtbFlag == 1)
        {
            dtbAddr = dtbAddr & 0x7FFFFFFF;
            Run_SDRAM(fileAddr,offset,tmpAddr,1,dtbAddr);
        }
        Run_SDRAM(fileAddr,offset,tmpAddr,0,0);
    }
    else
        MSG_DEBUG("only download ...\n");
}

/******************************************************************************
 *
 *  eMMC Functions
 *
 ******************************************************************************/
extern FW_MMC_IMAGE_T mmcImage;
extern FW_MMC_IMAGE_T *pmmcImage;
extern void GetMMCImage(void);

void Burn_MMC_RAW(UINT32 len, UINT32 offset,UINT8 *ptr)
{
    MSG_DEBUG("offset=%d,len=%d\n",offset>>9,len>>9);
    fmiSD_Write(offset>>9, len>>9, (UINT32)ptr);
}

