OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
void Read_MMC_RAW(UINT32 len, UINT32 offset,UINT8 *ptr)
{
    MSG_DEBUG("offset=%d,len=%d\n",offset>>9,len>>9);
    fmiSD_Read(offset>>9, len>>9, (UINT32)ptr);
}

int BatchBurn_MMC_BOOT(UINT32 len,UINT32 offset)
{
    int volatile tmplen=0;
    UINT32 TotalBlkCount,blockCount, mmcSourceAddr;
    UINT8 infoBuf[512],*ptr;

    unsigned char *_ch;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen;

    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));

    /* set up interface */
    if (fmiInitSDDevice() < 0)
    {
        SendAck(0xFFFFFFFF);
        return Fail;
    }

    /* check image 0 / offset 0 and back up */
    //if (pmmcImage->imageType == UBOOT)  // system image, burn nomal image
    //    fmiSD_Read(MMC_INFO_SECTOR,1,(UINT32)pInfo);

    mmcSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
    ptr = (UINT8 *)mmcSourceAddr;
    TotalBlkCount = blockCount = (len+((SD_SECTOR)-1))/(SD_SECTOR);

    while(blockCount>=SD_MUL)
    {
        ptr=_ch;
        remainlen=(SD_SECTOR*SD_MUL);
        do
        {
            if(Bulk_Out_Transfer_Size>0)
            {
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while((ptr-_ch)<(remainlen!=0));

        MSG_DEBUG("offset=0x%08x,ptr_addr=0x%08x,ptr=%d\n",offset,(UINT32)ptr,*(ptr));
        fmiSD_Write(offset,SD_MUL,(UINT32)ptr);
        blockCount-=SD_MUL;
        offset+=SD_MUL;
        /* ack status */
        tmplen += (SD_SECTOR*SD_MUL);
    }
    if(blockCount!=0)
    {
        ptr=_ch;
        remainlen=len-((SD_SECTOR)*(TotalBlkCount-blockCount));
        do
        {
            if(Bulk_Out_Transfer_Size>0)
            {
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;//|((pagetmp * 95) / total)<<16;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while((ptr-_ch)<(remainlen!=0));
        fmiSD_Write(offset,blockCount,(UINT32)ptr);
    }
    /* restore image 0 and offset 0 */
    if (pmmcImage->imageType == 3)   // system image, burn nomal image
    {
        if((pmmcImage)->macaddr[7]==1)
            memcpy(infoBuf+0x190,(UCHAR *)((pmmcImage)->macaddr),6);  // MAC Address
    }

    if ((pmmcImage->flashOffset != 2) || (pmmcImage->imageType == 3))
    {
        /* set MMC information */
        MSG_DEBUG("SetMMCImageInfo\n");
        SetMMCImageInfo(pmmcImage);
    }
    //ack status
    SendAck(100);

    return 0;
}

int BatchBurn_MMC(UINT32 len,UINT32 offset,UINT32 HeaderFlag)
{
    int volatile tmplen=0, i, blockCount=0;
    UINT32 volatile mmcSourceAddr;
    UINT8 volatile infoBuf[512],*ptr;
    unsigned char *_ch;
    unsigned int *_ack,ack=0;
    unsigned int volatile reclen,remainlen;
    unsigned int volatile headlen;

    if(HeaderFlag==1)
        headlen=IBR_HEADER_LEN;
    else
        headlen=0;

    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));

    /* set up interface */
    if (fmiInitSDDevice() < 0)
    {
        SendAck(0xFFFFFFFF);
        return Fail;
    }

    /* check image 0 / offset 0 and back up */
    //if (pmmcImage->imageType == UBOOT)  // system image, burn normal image
    //    fmiSD_Read(MMC_INFO_SECTOR,1,(UINT32)pInfo);

    mmcSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
    ptr = (UINT8 *)mmcSourceAddr;
    tmplen=len;
    MSG_DEBUG("debug eMMC  blockCount=%d   tmplen=%d    _ack = 0x%x\n",blockCount, tmplen, *_ack);
    while(tmplen>TRANSFER_LEN)
    {
        ptr=_ch+headlen;
        remainlen=(SD_SECTOR*SD_MUL);//4096
        //usleep(1000);
        do
        {
            MSG_DEBUG("Bulk_Out_Transfer_Size=%d   remainlen =%d\n",Bulk_Out_Transfer_Size, remainlen);
            if(Bulk_Out_Transfer_Size>0)
            {
                reclen=MIN(TRANSFER_LEN,remainlen);
                //MSG_DEBUG("reclen=0x%08x\n",reclen);
                usb_recv((UINT8 *)ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while(remainlen!=0);
        ptr=_ch;
        MSG_DEBUG("tmplen=0x%08x,ptr_addr=0x%08x,ptr=%d\n",tmplen,(UINT32)ptr,*(ptr));
        fmiSD_Write(offset,SD_MUL,(UINT32)ptr);
        //MSG_DEBUG("eMMC ret=0x%x\n",ret);
        blockCount-=SD_MUL;
        offset+=SD_MUL;
        tmplen -= (SD_SECTOR*SD_MUL);
        memcpy(_ch,_ch+(SD_SECTOR*SD_MUL),headlen);
    }

    if(tmplen!=0)
    {
        ptr=_ch+headlen;
        remainlen=tmplen;
        do
        {
            MSG_DEBUG("Last Bulk_Out_Transfer_Size=%d   remainlen =%d\n",Bulk_Out_Transfer_Size, remainlen);
            if(Bulk_Out_Transfer_Size>0)
            {
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv((UINT8 *)ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while(remainlen!=0);
        ptr=_ch;
        MSG_DEBUG("tmplen=0x%08x,ptr_addr=0x%08x,ptr=%d\n",tmplen,(UINT32)ptr,*(ptr));
        fmiSD_Write(offset,(tmplen+SD_SECTOR-1)/SD_SECTOR,(UINT32)ptr);
    }
    /* restore image 0 and offset 0 */
    if (pmmcImage->imageType == PACK)   // system image, burn normal image
    {
        if((pmmcImage)->macaddr[7]==1)
            memcpy((UINT8 *)infoBuf+0x190,(UCHAR *)((pmmcImage)->macaddr),6);  // MAC Address
    }

    if ((pmmcImage->flashOffset != 2) || (pmmcImage->imageType == PACK))
    {
        /* set MMC information */
        MSG_DEBUG("SetMMCImageInfo\n");
        SetMMCImageInfo(pmmcImage);
    }
    //ack status
    SendAck(100);

