OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    return 0;
}

void UXmodem_MMC()
{
    int volatile len,i, j, ret;
    PMBR pmbr;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int volatile blockCount,offset=0;
    PACK_CHILD_HEAD ppack;
    unsigned int ddrlen;

    MSG_DEBUG("Start  download image to eMMC flash...\n");
    /* initial eMMC */
    fmiInitSDDevice();

    memset((char *)&mmcImage, 0, sizeof(FW_MMC_IMAGE_T));
    pmmcImage = (FW_MMC_IMAGE_T *)&mmcImage;
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;
    while(1)
    {
        if(Bulk_Out_Transfer_Size>0)
        {
            usb_recv(ptr,sizeof(FW_MMC_IMAGE_T));
            memcpy(pmmcImage,(unsigned char *)ptr,sizeof(FW_MMC_IMAGE_T));
            break;
        }
    }
    MSG_DEBUG("Action flag: %s, image %d, len=0x%x(%d) exec=0x%08x\n",
              au8ActionFlagName[pmmcImage->actionFlag], pmmcImage->imageNo,pmmcImage->fileLength, pmmcImage->fileLength, pmmcImage->executeAddr);

    switch(pmmcImage->actionFlag)
    {
    case WRITER_MODE: /* normal write */
        MSG_DEBUG("eMMC normal write !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        MSG_DEBUG("Wait for USBD !!!\n");
        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        if (pmmcImage->imageType == UBOOT)      // system image
        {

            pmmcImage->imageNo = 0;
            pmmcImage->flashOffset = 0x400;
            addMagicHeader(pmmcImage->executeAddr, pmmcImage->fileLength);
            addNUC980MagicHeader(1);
            ptr += IBR_HEADER_LEN;// except the 32 bytes magic header
#if 0
            pmmcImage->executeAddr = 0x1200000;  /* 18MB */
#endif
        }
        MSG_DEBUG("Bulk_Out_Transfer_Size pmmcImage->fileLength=0x%08x!!!\n",pmmcImage->fileLength);

        MSG_DEBUG("Burn_MMC!!!\n");
        if (pmmcImage->imageType == UBOOT)
        {
            MSG_DEBUG("BatchBurn_MMC() [0x%x(%d)/0x%x(%d)/1]\n", pmmcImage->fileLength+pmmcImage->initSize+IBR_HEADER_LEN, pmmcImage->fileLength+pmmcImage->initSize+IBR_HEADER_LEN, (pmmcImage->flashOffset/SD_SECTOR), (pmmcImage->flashOffset/SD_SECTOR));
            ret = BatchBurn_MMC(pmmcImage->fileLength+pmmcImage->initSize+IBR_HEADER_LEN,(pmmcImage->flashOffset/SD_SECTOR),1);
            if(ret == 1)
            {
                printf("Error BatchBurn_MMC Device UBOOT image error !!! \n");
                return;
            }
        }
        else
        {
            MSG_DEBUG("BatchBurn_MMC() [0x%x(%d)/0x%x(%d)/0]\n", pmmcImage->fileLength, pmmcImage->fileLength, pmmcImage->flashOffset/SD_SECTOR, pmmcImage->flashOffset/SD_SECTOR);
            ret = BatchBurn_MMC(pmmcImage->fileLength,(pmmcImage->flashOffset/SD_SECTOR),0);
            if(ret == 1)
            {
                printf("Error BatchBurn_MMC Device others image error !!! \n");
                return;
            }
        }

        break;
    case MODIFY_MODE: /* modify */
        MSG_DEBUG("eMMC modify !!!\n");
        {
            int state;
            state = ChangeMMCImageType(pmmcImage->imageNo, pmmcImage->imageType);
            if (state < 0)
            {
                //MSG_DEBUG("error!!\n");
                SendAck(0xFFFFFFFF);
            }
            else
            {
                //MSG_DEBUG("OK!!\n");
                SendAck(100);
            }
        }
        break;
    case ERASE_MODE: /* erase */
        MSG_DEBUG("eMMC erase !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        //if pmmcImage->imageNo = 0xFFFFFFFF then erase all
        DelMMCImage(pmmcImage->imageNo);
        break;
    case VERIFY_MODE:   // verify
    {
        MSG_DEBUG("MMC normal verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        if(pmmcImage->imageType == UBOOT)
            blockCount = (pmmcImage->fileLength+IBR_HEADER_LEN+pmmcImage->initSize+((SD_SECTOR)-1))/(SD_SECTOR);
        else
            blockCount = (pmmcImage->fileLength+((SD_SECTOR)-1))/(SD_SECTOR);

        len=pmmcImage->fileLength;
        blockCount = (blockCount+SD_MUL-1)/SD_MUL;
        offset = pmmcImage->flashOffset/SD_SECTOR;

        if(pmmcImage->imageType==UBOOT)
        {
            fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
            offset+=SD_MUL;
            if(blockCount==1)
            {
                ptr=_ch+(IBR_HEADER_LEN+pmmcImage->initSize);
                usb_send(ptr,TRANSFER_LEN); //send data to PC
                while(Bulk_Out_Transfer_Size==0) {}
                usb_recv((unsigned char*)_ack,4);   //recv data from PC
            }
            else
            {
                INT32 volatile mvlen,tranferlen;
                tranferlen=len;
                mvlen=(SD_MUL*SD_SECTOR)-(IBR_HEADER_LEN+pmmcImage->initSize);
                memmove(_ch,_ch+(IBR_HEADER_LEN+pmmcImage->initSize),mvlen);
                //printf("len %d, blockCount=%d\n", len, blockCount);
                for(i=1; i<blockCount; i++)
                {
                    ptr=_ch+mvlen;
                    fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                    ptr=_ch;
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC
                    tranferlen-=TRANSFER_LEN;
                    memmove(_ch,_ch+(8*SD_SECTOR),mvlen);
                    offset+=SD_MUL;
                    //printf("%d   tranferlen = %d\n", i, tranferlen);
                }
                if(tranferlen>0)
                {
                    //printf("rnt tranferlen = %d\n", tranferlen);
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    //usb_send(ptr,tranferlen); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC
                }
            }
        }
        else
        {
            for(i=0; i<blockCount; i++)
            {
                fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                usb_send(ptr,TRANSFER_LEN); //send data to PC
                usb_recv((unsigned char*)_ack,4);   //recv data from PC
                offset+=SD_MUL;
            }
        }
    }
    break;
    case PACK_VERIFY_MODE:   // verify
    {
        MSG_DEBUG("eMMC PACK verify !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        for(j=0; j<pmmcImage->imageNo; j++)
        {
            MSG_DEBUG("loop %d:  pmmcImage->imageNo = %d,  initSize=0x%08x\n", j, pmmcImage->imageNo, pmmcImage->initSize);
            while(1)
            {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD))
                {
                    usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                    memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                    usleep(1000);
                    *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }

            pmmcImage->imageType = ppack.imagetype;
            pmmcImage->fileLength = ppack.filelen;
            pmmcImage->flashOffset = ppack.startaddr;
            MSG_DEBUG("pmmcImage->fileLength = %d(0x%x)\n", pmmcImage->fileLength, pmmcImage->fileLength);
            MSG_DEBUG("pmmcImage->flashOffset = %d(0x%x)\n", pmmcImage->flashOffset, pmmcImage->flashOffset);
            MSG_DEBUG("pmmcImage->imageType = %d(0x%x)\n", pmmcImage->imageType, pmmcImage->imageType);

            if(pmmcImage->imageType == UBOOT)
            {
                blockCount = (pmmcImage->fileLength+IBR_HEADER_LEN+pmmcImage->initSize+((SD_SECTOR)-1))/(SD_SECTOR);
                pmmcImage->flashOffset = 0x400;
                MSG_DEBUG("blockCount = %d\n", blockCount);
                MSG_DEBUG("pmmcImage->flashOffset = %d(0x%x)\n", pmmcImage->flashOffset, pmmcImage->flashOffset);

                // Get DDR parameter length
                usb_recv(ptr,4);
                memcpy(&ddrlen,(unsigned char *)ptr,4);
                MSG_DEBUG("ddrlen = %d\n", ddrlen);
                usleep(1000);
                *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
                usb_send((unsigned char*)_ack,4);//send ack to PC

