OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
            }
            else
            {
                blockCount = (pmmcImage->fileLength+((SD_SECTOR)-1))/(SD_SECTOR);
                MSG_DEBUG("blockCount = %d\n", blockCount);
            }

            ptr=_ch;
            len=pmmcImage->fileLength;
            blockCount = (blockCount+SD_MUL-1)/SD_MUL;
            offset = pmmcImage->flashOffset/SD_SECTOR;
            if(pmmcImage->imageType==UBOOT)
            {
                fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                offset+=8;
                if(blockCount==1)
                {
                    ptr=_ch+(IBR_HEADER_LEN+pmmcImage->initSize);
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC
                }
                else
                {
                    INT32 mvlen,tranferlen;
                    tranferlen=len-IBR_HEADER_LEN-ddrlen;
                    mvlen=(SD_MUL*SD_SECTOR)-(IBR_HEADER_LEN+pmmcImage->initSize)-ddrlen;
                    memmove(_ch,_ch+(IBR_HEADER_LEN+pmmcImage->initSize)+ddrlen,mvlen);
                    for(i=1; i<blockCount; i++)
                    {
                        ptr=_ch+mvlen;
                        fmiSD_Read(offset,8,(UINT32)ptr);
                        ptr=_ch;
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4);   //recv data from PC
                        tranferlen-=TRANSFER_LEN;
                        memmove(_ch,_ch+(SD_MUL*SD_SECTOR),mvlen);
                        offset+=SD_MUL;
                    }
                    if(tranferlen>0)
                    {
                        MSG_DEBUG("Last transfer %d    0x%x\n", tranferlen, mvlen);
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        //usb_send(ptr,tranferlen); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                    }
                }
            }
            else
            {
                for(i=0; i<blockCount; i++)
                {
                    fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                    usb_send(ptr,TRANSFER_LEN);//send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);//recv data from PC
                    offset+=8;
                }
            }
        }
    }
    break;
    case FORMAT_MODE:   /* Format */
    {
        unsigned int *ptr;
        UCHAR _fmi_ucBuffer[512];
        ptr = (unsigned int *)((UINT32)_fmi_ucBuffer | 0x80000000);
        MSG_DEBUG("eMMC format !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        printf("pmmcImage->ReserveSize = %d ! eMMCBlockSize = %d\n",pmmcImage->ReserveSize, eMMCBlockSize);
        MSG_DEBUG("PartitionNum =%d, P1=%d(0x%x)MB P2=%d(0x%x)MB P3=%d(0x%x)MB P4=%d(0x%x)MB\n", pmmcImage->PartitionNum, pmmcImage->PartitionS1Size, pmmcImage->PartitionS1Size, pmmcImage->PartitionS2Size, pmmcImage->PartitionS2Size,
                  pmmcImage->PartitionS3Size, pmmcImage->PartitionS3Size, pmmcImage->PartitionS4Size, pmmcImage->PartitionS4Size);
        if(eMMCBlockSize>0)
        {
            //pmbr=create_mbr(eMMCBlockSize,pmmcImage->ReserveSize);
            //FormatFat32(pmbr,0);
            pmbr=create_mbr(eMMCBlockSize, pmmcImage);
            switch(pmmcImage->PartitionNum)
            {
            case 1:
                FormatFat32(pmbr,0);
                break;
            case 2:
            {
                FormatFat32(pmbr,0);
                FormatFat32(pmbr,1);
            }
            break;
            case 3:
            {
                FormatFat32(pmbr,0);
                FormatFat32(pmbr,1);
                FormatFat32(pmbr,2);
            }
            break;
            case 4:
            {
                FormatFat32(pmbr,0);
                FormatFat32(pmbr,1);
                FormatFat32(pmbr,2);
                FormatFat32(pmbr,3);
            }
            break;
            }

            fmiSD_Read(MMC_INFO_SECTOR,1,(UINT32)ptr);
            *(ptr+125)=0x11223344;
            *(ptr+126)=pmmcImage->ReserveSize;
            *(ptr+127)=0x44332211;
            fmiSD_Write(MMC_INFO_SECTOR,1,(UINT32)ptr);
            SendAck(100);
        }
        else
            SendAck(0xFFFFFFFF);
    }
    break;
    case READ_MODE:
    {
        MSG_DEBUG("MMC normal read !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        offset = pmmcImage->flashOffset;
        blockCount = (pmmcImage->fileLength+((SD_SECTOR)-1))/(SD_SECTOR);
        blockCount = (blockCount+8-1)/8;
        while(blockCount)
        {

            fmiSD_Read(offset,8,(UINT32)ptr);
            MSG_DEBUG("offset=0x%08x,ptr_addr=0x%08x,ptr=%d\n",offset,(UINT32)ptr,*(ptr));
            offset+=8;
            blockCount--;
            usb_send(ptr,4096); //send data to PC
            while(Bulk_Out_Transfer_Size==0) {}
            usb_recv((unsigned char*)_ack,4);   //recv data from PC
        }
    }
    break;
    case PACK_MODE:
    {
        MSG_DEBUG("MMC normal pack !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        {
            PACK_HEAD pack;
            PACK_CHILD_HEAD ppack;
            while(1)
            {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_HEAD))
                {
                    usb_recv(ptr,sizeof(PACK_HEAD));
                    memcpy(&pack,(unsigned char *)ptr,sizeof(PACK_HEAD));
                    *_ack=sizeof(PACK_HEAD);
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }
            MSG_DEBUG("pack.actionFlag=0x%x, pack.fileLength=0x%08x pack.num=%d!!!\n",pack.actionFlag,pack.fileLength,pack.num);
            for(i=0; i<pack.num; i++)
            {
                while(1)
                {
                    if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD))
                    {
                        usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                        memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                        *_ack=sizeof(PACK_CHILD_HEAD);
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        break;
                    }
                }
                MSG_DEBUG("ppack.filelen=0x%x, ppack.imagetype %d  ppack.startaddr=0x%08x!!!\n",ppack.filelen,ppack.imagetype,ppack.startaddr);
                if(ppack.imagetype!=PARTITION)
                {
                    if(ppack.imagetype==UBOOT)
                        ppack.startaddr=0x400;
                    BatchBurn_MMC(ppack.filelen,ppack.startaddr/SD_SECTOR,0);
                }
            }
        }
    }
    break;
    }
}

