OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    // write into flash
    blockNum = blockNo;
    total = page_count;

    // define for USB ack
    addr = address | NON_CACHE;

    // erase needed blocks
    block_count = page_count / pSM->uPagePerBlock;

    for (j=0; j<block_count; j++)
    {
        // block erase
//_retry_1:
        page = pSM->uPagePerBlock * (blockNum);
        status = fmiSM_BlockErase(pSM, blockNum);
        if (status != 0)
        {
            fmiMarkBadBlock(pSM, blockNum);
            MSG_DEBUG("bad block = %d\n",blockNum);
            blockNum++;
            continue;
        }

        // write block
        for (i=0; i<pSM->uPagePerBlock; i++)
        {
            status = fmiSM_Write_large_page(page+i, 0, addr);
            if (status != 0)
            {
                fmiMarkBadBlock(pSM, blockNum);
                MSG_DEBUG("bad block = %d\n",blockNum);
                blockNum++;
                addr = (address + j * pSM->uPagePerBlock * pSM->uPageSize) | NON_CACHE;
                continue;
            }
            addr += pSM->uPageSize;
            pagetmp++;
        }
        blockNum++;
    }

    if ((page_count % pSM->uPagePerBlock) != 0)
    {
        page_count = page_count - block_count * pSM->uPagePerBlock;
        block_count++;
        // erase block
//_retry_2:
        page = pSM->uPagePerBlock * (blockNum);
        status = fmiSM_BlockErase(pSM, blockNum);
        if (status != 0)
        {
            fmiMarkBadBlock(pSM, blockNum);
            blockNum++;
            //goto _retry_2;
            return status;
        }

        // write block
        for (i=0; i<page_count; i++)
        {
            status = fmiSM_Write_large_page(page+i, 0, addr);
            if (status != 0)
            {
                fmiMarkBadBlock(pSM, blockNum);
                blockNum++;
                addr = (address + block_count * pSM->uPagePerBlock * pSM->uPageSize) | NON_CACHE;
                //goto _retry_2;
                return status;
            }
            addr += pSM->uPageSize;
            pagetmp++;
        }
        blockNum++;
    }
    return status;
}

void UXmodem_NAND()
{
    int i,offset=0, ret;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int len;
    PACK_CHILD_HEAD ppack;
    unsigned int ddrlen;
    unsigned int total,offblk=0;

    MSG_DEBUG("download image to NAND flash...\n");
    /* TODO: initial NAND */
    fmiNandInit();
    MSG_DEBUG("g_uIsUserConfig=%d\n",g_uIsUserConfig);
    MSG_DEBUG("UXmodem_NAND BlockPerFlash=%d\n",pSM->uBlockPerFlash);
    MSG_DEBUG("UXmodem_NAND PagePerBlock=%d\n",pSM->uPagePerBlock);
    MSG_DEBUG("UXmodem_NAND PageSize=%d\n",pSM->uPageSize);
    memset((char *)&nandImage, 0, sizeof(FW_NAND_IMAGE_T));
    pNandImage = (FW_NAND_IMAGE_T *)&nandImage;

    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;
    while(1)
    {
        if(Bulk_Out_Transfer_Size>0)
        {
            usb_recv(ptr,sizeof(FW_NAND_IMAGE_T));
            memcpy(pNandImage, (unsigned char *)ptr, sizeof(FW_NAND_IMAGE_T));
            break;
        }
    }
    MSG_DEBUG("Action flag: %s, blockNo 0x%x(%d) len 0x%x(%d)\n", au8ActionFlagName[pNandImage->actionFlag],pNandImage->blockNo, ,pNandImage->blockNo, pNandImage->fileLength, pNandImage->fileLength);

    switch (pNandImage->actionFlag)
    {
    case WRITER_MODE:   // normal write
    {
        MSG_DEBUG("NAND normal write !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        MSG_DEBUG("NAND normal write2 !!!\n");
        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        if (pNandImage->imageType == UBOOT)   // system image
        {
            pNandImage->imageNo = 0;
            pNandImage->blockNo = 0;
            addMagicHeader(pNandImage->executeAddr, pNandImage->fileLength);
            addNUC980MagicHeader(1);
            ptr += IBR_HEADER_LEN;// except the 32 bytes magic header
            offset = IBR_HEADER_LEN;
        }
        else
            offset = 0;

        len=pSM->uPagePerBlock*pSM->uPageSize;
        MSG_DEBUG("NAND normal Burn_NAND !!!\n");
        if (pNandImage->imageType == UBOOT)     // system image
        {
            BatchBurn_NAND_BOOT(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,0,4,1);
            MSG_DEBUG("pNandImage->fileLength = 0x%x\n", pNandImage->fileLength);
        }
        else
        {
            if(pNandImage->imageType!=IMAGE)
            {
                if(pNandImage->imageType == DATA_OOB)
                {
                    MSG_DEBUG("DATA_OOB type\n");
                    BatchBurn_NAND_Data_OOB(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),pNandImage->imageType);
                }
                else
                {
                    BatchBurn_NAND(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),pNandImage->imageType);
                }
            }
            else
            {
                MSG_DEBUG("_ch[0]=%c,_ch[1]=%c,_ch[2]=%c,_ch[3]=%c\n",(char)_ch[0],(char)_ch[1],(char)_ch[2],(char)_ch[3]);
                if(((char)_ch[0])=='U' && ((char)_ch[1])=='B' && ((char)_ch[2])=='I')
                {
                    BatchBurn_NAND(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),UBIFS);
                }
                else
                {
                    BatchBurn_NAND(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),YAFFS2);
                }
            }
        }
    }
    break;

