OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    case MODIFY_MODE:   // modify
    {
        MSG_DEBUG("NAND modify !!!\n");
    }
    break;

    case ERASE_MODE:    // erase
    {
        MSG_DEBUG("NAND erase !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("\nstart=%d\n",pNandImage->blockNo); //start block
        MSG_DEBUG("length=%d\n",pNandImage->executeAddr); //block length
        MSG_DEBUG("type=%d\n",pNandImage->imageType); //0: chip erase, 1: erase accord start and length blocks.
        MSG_DEBUG("imageNo=0x%08x\n",pNandImage->imageNo);

        if(pNandImage->imageType==0)   //chip erase
        {
            if (pNandImage->imageNo == 0xFFFFFFFF)
            {
                int bb;
                bb = fmiSM_ChipErase(0);
                if (bb < 0)
                {
                    MSG_DEBUG("ERROR: %d bad block\n", bb); // storage error
                    *_ack=0xffff;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                }
                else
                    MSG_DEBUG("total %d bad block\n", bb);
            }
            else
            {
                fmiSM_ChipEraseBad(0);
            }
        }
        else
        {
            if (pNandImage->imageNo == 0xFFFFFFFF)
            {
                int bb;
                bb = fmiSM_Erase(0,pNandImage->blockNo,pNandImage->executeAddr);
                printf("total %d bad block\n", bb);
            }
            else
            {
                MSG_DEBUG("fmiSM_EraseBad\n");
                fmiSM_EraseBad(0,pNandImage->blockNo,pNandImage->executeAddr);
            }
        }
    }
    break;

    case VERIFY_MODE:   // verify
    {
        MSG_DEBUG("NAND normal verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        {
            if (pNandImage->imageType == UBOOT)     // system image
            {
                int offblk=0;
                _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                ptr=_ch;
                while(fmiCheckInvalidBlock(pSM, pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk) == 1)
                {
                    offblk++;
                }
                Read_Nand(DOWNLOAD_BASE,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk,pNandImage->fileLength+IBR_HEADER_LEN+pNandImage->initSize);
                memmove(_ch,_ch+IBR_HEADER_LEN+pNandImage->initSize,pNandImage->fileLength);
                do
                {
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                }
                while((ptr-_ch)<(pNandImage->fileLength));
            }
            else
            {
                int total,offblk=0;
                total=pNandImage->fileLength;
                do
                {
                    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                    ptr=_ch;
                    len=MIN(total,pSM->uPagePerBlock*pSM->uPageSize);
                    memset(ptr, 0xff, pSM->uPagePerBlock*pSM->uPageSize);
                    while(fmiCheckInvalidBlock(pSM, pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk) == 1)
                    {
                        offblk++;
                    }
                    Read_Nand(DOWNLOAD_BASE,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk,len);
                    MSG_DEBUG("Read_NAND offblk=%d,len=%d\n",offblk,len);
                    do
                    {
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                        ptr += (*_ack);
                        MSG_DEBUG("read size=0x%08x\n",(unsigned int)(ptr-_ch));
                    }
                    while((int)(ptr-_ch)<len);
                    total-=len;
                    offblk+=1;
                    MSG_DEBUG("total=%d len=%d\n",total,len);
                }
                while(total!=0);
            }
        }
    }
    break;
    case PACK_VERIFY_MODE: // verify
    {
        MSG_DEBUG("\n NAND PACK verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        //printf("PACK_VERIFY_MODE pNandImage->imageNo= %d\n", pNandImage->imageNo);
        for(i=0; i<pNandImage->imageNo; i++)
        {
            while(1)
            {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD))
                {
                    usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                    memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                    usleep(1000);
                    *_ack=0x83;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }

            if (ppack.imagetype == UBOOT)     // system image
            {
                int offblk=0;
                int rawfilelen = 0;
                _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                ptr=_ch;
                while(fmiCheckInvalidBlock(pSM, pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk) == 1)
                {
                    offblk++;
                }
                // Get DDR parameter length
                usb_recv(ptr,4);
                memcpy(&ddrlen,(unsigned char *)ptr,4);
                MSG_DEBUG("ddrlen = 0x%x(%d)\n", ddrlen, ddrlen);
                //usleep(1000);
                *_ack=0x83;
                usb_send((unsigned char*)_ack,4);//send ack to PC
                Read_Nand(DOWNLOAD_BASE,offblk,ppack.filelen+IBR_HEADER_LEN+ppack.startaddr);
                memmove(_ch,_ch+IBR_HEADER_LEN+ddrlen+ppack.startaddr,ppack.filelen);
                rawfilelen = ppack.filelen - (ddrlen+IBR_HEADER_LEN+ppack.startaddr);
                do
                {
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                }
                while((ptr-_ch)<(rawfilelen));

