OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
            }
            else
            {
                int total,offblk=0;
                total=ppack.filelen;
                pNandImage->blockNo = ppack.startaddr;
                do
                {
                    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                    ptr=_ch;
                    len=MIN(total,pSM->uPagePerBlock*pSM->uPageSize);
                    memset(ptr, 0xff, pSM->uPagePerBlock*pSM->uPageSize);
                    while(fmiCheckInvalidBlock(pSM, pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk) == 1)
                    {
                        offblk++;
                    }
                    Read_Nand(DOWNLOAD_BASE,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk,len);
                    MSG_DEBUG("Read_NAND offblk=%d,len=%d\n",offblk,len);
                    do
                    {
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                        ptr += (*_ack);
                        MSG_DEBUG("read size=0x%08x\n",(unsigned int)(ptr-_ch));
                    }
                    while((int)(ptr-_ch)<len);
                    total-=len;
                    offblk+=1;
                    MSG_DEBUG("total=%d len=%d\n",total,len);
                }
                while(total!=0);
            }
        }
    }
    break;
    case READ_MODE:   // read
    {
        MSG_DEBUG("NAND normal read !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("offset=%d,blockNo=%d,fileLength=%d\n",offset,pNandImage->blockNo,pNandImage->fileLength);

        total=pNandImage->fileLength;
        do
        {
            _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
            ptr=_ch;
            if(pNandImage->initSize==0)   //0: read good block , others : read redundancy area,good block and bad block
            {
                len=MIN(total,pSM->uPagePerBlock*pSM->uPageSize);
                memset(ptr, 0, len);
                while(fmiCheckInvalidBlock(pSM, pNandImage->blockNo+offblk) == 1)
                {
                    offblk++;
                }
                Read_Nand(DOWNLOAD_BASE,pNandImage->blockNo+offblk,len);
                do
                {
                    usb_send(ptr,4096); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                }
                while((ptr-_ch)<len);
                total-=len;
                offblk+=1;
            }
            else
            {
                len=MIN(total,pSM->uPagePerBlock*(pSM->uPageSize+pSM->uSpareSize));
                memset(ptr, 0, len);
                Read_Nand_Redunancy(DOWNLOAD_BASE,pNandImage->blockNo+offblk,len);
                do
                {
                    usb_send(ptr,pSM->uPageSize); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                    usb_send(ptr,pSM->uSpareSize); //send redundancy data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv redundancy data from PC
                    ptr += (*_ack);
                }
                while((ptr-_ch)<len);
                total-=(len);
                offblk+=1;
            }
        }
        while(total!=0);
    }
    break;
    case PACK_MODE:
    {
        MSG_DEBUG("NAND pack mode !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        {
            PACK_HEAD pack;
            PACK_CHILD_HEAD ppack;
            while(1)
            {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_HEAD))
                {
                    usb_recv(ptr,sizeof(PACK_HEAD));
                    memcpy(&pack,(unsigned char *)ptr,sizeof(PACK_HEAD));
                    *_ack=sizeof(PACK_HEAD);
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }
            MSG_DEBUG("pack.actionFlag=0x%x, pack.fileLength=0x%08x pack.num=%d!!!\n",pack.actionFlag,pack.fileLength,pack.num);
            for(i=0; i<pack.num; i++)
            {
                while(1)
                {
                    if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD))
                    {
                        usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                        memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                        *_ack=sizeof(PACK_CHILD_HEAD);
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        break;
                    }
                }
                MSG_DEBUG("%d ppack.filelen=0x%x, ppack.startaddr=0x%08x!!!\n",i,ppack.filelen,ppack.startaddr);

                if(ppack.imagetype==UBOOT)
                {
                    ret = BatchBurn_NAND_BOOT(ppack.filelen,0,4,0);
                    if(ret == -1)
                    {
                        printf("Nand Device image error !!! \n");
                        return;
                    }
                }
                else
                {
                    if(ppack.imagetype!=IMAGE)
                    {
                        BatchBurn_NAND(ppack.filelen,ppack.startaddr/(pSM->uPageSize*pSM->uPagePerBlock),pNandImage->imageType);
                    }
                    else
                    {
                        MSG_DEBUG("_ch[0]=%c,_ch[1]=%c,_ch[2]=%c,_ch[3]=%c\n",(char)_ch[0],(char)_ch[1],(char)_ch[2],(char)_ch[3]);
                        if(((char)_ch[0])=='U' && ((char)_ch[1])=='B' && ((char)_ch[2])=='I')
                        {
                            ret = BatchBurn_NAND(ppack.filelen,ppack.startaddr/(pSM->uPageSize*pSM->uPagePerBlock),UBIFS);
                            if(ret == -1)
                            {
                                MSG_DEBUG("BatchBurn_NAND Device image error !!! \n");
                                return;
                            }
                        }
                        else
                        {
                            BatchBurn_NAND(ppack.filelen,ppack.startaddr/(pSM->uPageSize*pSM->uPagePerBlock),YAFFS2);
                        }
                    }
                }
            }
        }
    }
    break;
    default:
        ;
        break;
    }
    MSG_DEBUG("finish NAND image download\n");
}

