OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
/******************************************************************************
 *
 *  SPI NAND Functions
 *
 ******************************************************************************/
FW_SPINAND_IMAGE_T spinandImage;
FW_SPINAND_IMAGE_T *pspiNandImage;
//unsigned char *program_buffer;
unsigned char *read_buffer;

int BatchBurn_SPINAND(UINT32 len,UINT32 blockNo,UINT32 type)
{
    int volatile status = 0;
    int volatile page_count, block_count, page, addr;
    int volatile i, j;
    unsigned int address = DOWNLOAD_BASE;
    unsigned int sparesize;  //Put yaffs2 tag on the oob(sparesize).
    unsigned char *_ch,*ptr;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen, block_idx, blockNum, total;
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;

    sparesize=0;

    page_count = len / (pSN->SPINand_PageSize+sparesize);
    if(len%(pSN->SPINand_PageSize+sparesize)!=0) page_count++;
    // erase needed blocks
    block_count = page_count / (pSN->SPINand_PagePerBlock);

    // write into flash
    blockNum = blockNo;
    total = len;
    MSG_DEBUG(">>>>>> blockNum=%d    total=%d    block_count=%d   sparesize =%d  page_count =%d\n",blockNum,total, block_count, sparesize, page_count);
    for (j=0; j<block_count; j++)
    {
        MSG_DEBUG("======= j=%d, block_count=%d\n", j, block_count);
        ptr=_ch;
        remainlen=MIN(total,pSN->SPINand_PagePerBlock*(pSN->SPINand_PageSize+sparesize));
        do
        {
            if(Bulk_Out_Transfer_Size>0)
            {
                MSG_DEBUG("total=%d,remainlen=%d\n",total,remainlen);
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while(remainlen!=0);

        MSG_DEBUG(">>>>>> remainlen OK\n");

_retry_1:
        block_idx = blockNum*pSN->SPINand_PagePerBlock;
        addr = address | NON_CACHE;
        page = pSN->SPINand_PagePerBlock * blockNum;
        MSG_DEBUG("fmiSM_BlockErase page = %d   blockNum = %d  j=%d  addr =0x%x\n", page, blockNum, j, addr);

        if(spiNAND_bad_block_check(page) == 1)
        {
            printf("bad block = %d\n", blockNum);
            blockNum++;
            goto _retry_1;
        }
        else
        {
            spiNAND_BlockErase(((block_idx>>8)&0xFF), (block_idx&0xFF)); // block erase
            status = spiNAND_Check_Program_Erase_Fail_Flag();
            if (status == 1)
            {
                printf("Error erase status! spiNANDMarkBadBlock blockNum = %d\n", blockNum);
                spiNANDMarkBadBlock(blockNum*pSN->SPINand_PagePerBlock);
                blockNum++;
                goto _retry_1;
            }
        }

        MSG_DEBUG("#2294 pSN->SPINand_PagePerBlock=%08d\n",pSN->SPINand_PagePerBlock);
        // write block
        for (i=0; i<pSN->SPINand_PagePerBlock; i++)
        {
            MSG_DEBUG("#2297 blockNum=%d,  page+i=%d\n",blockNum, page+i);
            spiNAND_Pageprogram_Pattern(0, 0, (uint8_t*)addr, pSN->SPINand_PageSize);
            spiNAND_Program_Excute((((page+i)>>8)&0xFF), (page+i)&0xFF);
            status = (spiNAND_StatusRegister(3) & 0x0C)>>2;
            if (status == 1)
            {
                spiNANDMarkBadBlock(blockNum*pSN->SPINand_PagePerBlock);
                printf("Error write status! spiNANDMarkBadBlock blockNum = %d\n", blockNum);
                blockNum++;
                addr+=(pSN->SPINand_PageSize* pSN->SPINand_PagePerBlock);
                goto _retry_1;
            }
            addr += pSN->SPINand_PageSize;
        }
        blockNum++;
    }

    MSG_DEBUG("page_count=%d,pSM->uPagePerBlock=%d, blockNum=%d\n",page_count,pSN->SPINand_PagePerBlock, blockNum);
    if ((page_count % pSN->SPINand_PagePerBlock) != 0)
    {
        MSG_DEBUG("Cnt=%d\n",page_count % pSN->SPINand_PagePerBlock);
        memset(_ch,0xff,pSN->SPINand_PagePerBlock*(pSN->SPINand_PageSize+sparesize));
        ptr=_ch;
        remainlen=total;
        do
        {
            if(Bulk_Out_Transfer_Size>0)
            {
                MSG_DEBUG("remainlen=%d\n",remainlen);
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while(remainlen!=0);
        page_count = page_count - (block_count *  pSN->SPINand_PagePerBlock);
        MSG_DEBUG("page_count=%d\n",page_count);
_retry_2:
        addr = address | NON_CACHE;
        page =  pSN->SPINand_PagePerBlock * blockNum;

        if(spiNAND_bad_block_check(page) == 1)
        {
            printf("bad_block:%d\n", blockNum);
            blockNum++;
            goto _retry_2;
        }
        else
        {
            spiNAND_BlockErase( ((page>>8)&0xFF), (page&0xFF));
            status = spiNAND_Check_Program_Erase_Fail_Flag();
            if (status == 1)
            {
                spiNANDMarkBadBlock(blockNum*pSN->SPINand_PagePerBlock);
                printf("Error erase status! bad_block:%d\n", blockNum);
                blockNum++;
                goto _retry_2;
            }

            // write block
            MSG_DEBUG("page_count=%d,type=%d\n",page_count,type);
            for (i=0; i<page_count; i++)
            {
                MSG_DEBUG("blockNum=%d,  page+i=%d\n",blockNum, page+i);
                spiNAND_Pageprogram_Pattern(0, 0, (uint8_t*)addr, pSN->SPINand_PageSize);
                spiNAND_Program_Excute((((page+i)>>8)&0xFF), ((page+i)&0xFF));
                status = (spiNAND_StatusRegister(3) & 0x0C)>>2;
                if (status != 0)
                {
                    spiNANDMarkBadBlock(blockNum*pSN->SPINand_PagePerBlock);
                    printf("Error write status! spiNANDMarkBadBlock blockNum = %d\n", blockNum);
                    blockNum++;
                    addr+=(pSN->SPINand_PageSize* pSN->SPINand_PagePerBlock);
                    goto _retry_2;
                }
                addr += pSN->SPINand_PageSize;
            }
            blockNum++;
        }
    }

    MSG_DEBUG("BatchBurn_SPINAND() End blockNum-blockNo=%d\n", blockNum-blockNo);
    SendAck(blockNum-blockNo);
    return status;
}

int BatchBurn_SPINAND_Data_OOB(UINT32 len,UINT32 blockNo,UINT32 type)
{
    int volatile status = 0;
    int volatile page_count, block_count, page, addr;
    int volatile i, j;
    unsigned int address = DOWNLOAD_BASE;
    unsigned char *_ch,*ptr;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen, block_idx, blockNum, total;
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;

    page_count = len / (pSN->SPINand_PageSize+pSN->SPINand_SpareArea);
    if(len%(pSN->SPINand_PageSize+pSN->SPINand_SpareArea)!=0) page_count++;
    // erase needed blocks
    block_count = page_count / (pSN->SPINand_PagePerBlock);

