OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    if(HeaderFlag==1)
        headlen=IBR_HEADER_LEN;
    else
        headlen=0;

    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;
    page_count = len / pSN->SPINand_PageSize;
    if ((len % pSN->SPINand_PageSize) != 0)
        page_count++;

    // write into flash
    blockNum = blockNo;
    total = page_count*blockLen;

    // erase needed blocks
    block_count = page_count / (pSN->SPINand_PagePerBlock);
    MSG_DEBUG(">>>>>> len=%d  blockLen=%d  blockNum=%d    total=%d    block_count=%d  page_count =%d\n",len, blockLen, blockNum, total, block_count, page_count);

    if (page_count <= pSN->SPINand_PagePerBlock)
    {
        memset(_ch+headlen,0xff,(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize));
        ptr=_ch+headlen;
        remainlen=len-(block_count*pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)-headlen;
        MSG_DEBUG("remainlen=%d,block_count=%d\n",remainlen,block_count);
        do
        {
            if(Bulk_Out_Transfer_Size>0)
            {
                reclen=MIN(Bulk_Out_Transfer_Size,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen|((pagetmp * 95) / total)<<16;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        }
        while(remainlen!=0);
//_retry_2:
        // erase block
        for(blkindx=blockNum; blkindx<blockLen; blkindx++)
        {
            addr = address | NON_CACHE;
            page = pSN->SPINand_PagePerBlock * (blkindx);

            if(spiNAND_bad_block_check(page) == 1)
            {
                printf("bad_block:%d\n", blockNum);
                //blockNum++;
                //goto _retry_2;
                continue;
            }
            else
            {
                MSG_DEBUG("blkindx = %d   page = %d   page_count=%d\n", blkindx, page, page_count);
                spiNAND_BlockErase(((page>>8)&0xFF), (page&0xFF)); // block erase
                status = spiNAND_Check_Program_Erase_Fail_Flag();
                if (status != 0)
                {
                    printf("Error erase status! bad_block:%d\n", blockNum);
                    spiNANDMarkBadBlock(page);
                    //blockNum++;
                    //goto _retry_2;
                    continue;
                }

                // write block
                for (i=0; i<page_count; i++)
                {
                    MSG_DEBUG("page+i=%d\n",page+i);
                    spiNAND_Pageprogram_Pattern(0, 0, (uint8_t*)addr, pSN->SPINand_PageSize);
                    spiNAND_Program_Excute((((page+i)>>8)&0xFF), (page+i)&0xFF);
                    status = (spiNAND_StatusRegister(3) & 0x0C)>>2;
                    if (status == 1)
                    {
                        printf("Error write status! bad_block:%d\n", blockNum);
                        spiNANDMarkBadBlock(page);
                        //blockNum++;
                        //addr = (address + block_count * pSN->SPINand_PagePerBlock * pSN->SPINand_PageSize) | NON_CACHE;
                        //addr+=(pSN->SPINand_PageSize* pSN->SPINand_PagePerBlock);
                        //goto _retry_2;
                        continue;
                    }
                    addr += pSN->SPINand_PageSize;
                    pagetmp++;
                }
            }
            //blockNum++;
        }
    }
    else
    {
        printf("Error Device image Error !!!\n");
        usb_recv(ptr, Bulk_Out_Transfer_Size);  //recv data from PC
        *_ack = 0xFFFF;
        usb_send((unsigned char*)_ack,4);//send ack to PC
        return -1;
    }
    SendAck(block_count+blockLen);
    MSG_DEBUG("SendAck 0x%x\n", block_count+blockLen);
    return status;
}

int Read_SPINand(UINT32 dst_adr,UINT32 blockNo, UINT32 len)
{
    int volatile status = 0;
    int volatile page_count, blockNum;
    int volatile page_no, total, i=0, j=0, k;
    unsigned int block_count;

    MSG_DEBUG("len =%d, blockNo=%d    %d\n", len, blockNo, (pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock));
    block_count = len / (pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock);
    page_count = len / pSN->SPINand_PageSize;
    if ((len % (pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock)) != 0) block_count++;
    blockNum = blockNo;
    total = len;

    while(1)
    {
_retry_:
        for (i=0; i<pSN->SPINand_PagePerBlock; i++)
        {
            page_no = (blockNum * pSN->SPINand_PagePerBlock) + i;
            MSG_DEBUG("blockNum =%d  page_no = %d   total=%d  pageSize=%d\n", blockNum, page_no, total, pSN->SPINand_PageSize);
            spiNAND_PageDataRead((page_no>>8)&0xFF, (page_no&0xFF));// Read verify
            //spiNAND_QuadIO_Read(0, 0, (uint8_t*)dst_adr, pSN->SPINand_PageSize);
            spiNAND_Normal_Read(0, 0, (uint8_t*)dst_adr, pSN->SPINand_PageSize);
            status = spiNAND_Check_Embedded_ECC_Flag();
            if(status != 0x00 && status != 0x01)
            {
                //spiNANDMarkBadBlock(page_no);
                MSG_DEBUG("Error ECC status error[0x%x].\n", status);// Check ECC status and return fail if (ECC-1, ECC0) != (0,0) or != (0,1)
                blockNum++;
                total = len;
                goto _retry_;
            }
            dst_adr += pSN->SPINand_PageSize;
            total -= pSN->SPINand_PageSize;
        }
        j++;
        blockNum++;
        if ((j >= block_count) || (total <= 0))
            break;
    }

    MSG_DEBUG("End Read_SPINand  total = %d\n", total);
    return 0;
}

int Read_SPINand_Redunancy(UINT32 dst_adr,UINT32 blockNo, UINT32 len)
{
    int volatile status = 0;
    int volatile page_count, blockNum;
    int volatile page_no, total, i=0, j=0, k;
    unsigned int block_count;
    int spareSize;

    MSG_DEBUG("Read_SPINand_Redunancy %d len =%d, blockNo=%d    %d\n", pSN->SPINand_PageSize+spareSize, len, blockNo, ((pSN->SPINand_PageSize+spareSize)*pSN->SPINand_PagePerBlock));
    spareSize = pSN->SPINand_SpareArea;
    block_count = len / ((pSN->SPINand_PageSize+spareSize)*pSN->SPINand_PagePerBlock);
    page_count = len / (pSN->SPINand_PageSize+spareSize);
    if ((len % ((pSN->SPINand_PageSize+spareSize)*pSN->SPINand_PagePerBlock)) != 0) block_count++;
    blockNum = blockNo;
    total = len;

    while(1)
    {
_retry_:
        for (i=0; i<pSN->SPINand_PagePerBlock; i++)
        {
            page_no = (blockNum * pSN->SPINand_PagePerBlock) + i;
            MSG_DEBUG("blockNum =%d  page_no = %d   total=%d  pageSize=%d\n", blockNum, page_no, total, pSN->SPINand_PageSize+64);
            spiNAND_PageDataRead((page_no>>8)&0xFF, (page_no&0xFF));// Read verify
            spiNAND_Normal_Read(0, 0, (uint8_t*)dst_adr, pSN->SPINand_PageSize+spareSize);
            status = spiNAND_Check_Embedded_ECC_Flag();
            if(status != 0x00 && status != 0x01)
            {
                MSG_DEBUG("Error ECC status error[0x%x].\n", status);// Check ECC status and return fail if (ECC-1, ECC0) != (0,0) or != (0,1)
                blockNum++;
                total = len;
                goto _retry_;
            }
            dst_adr += (pSN->SPINand_PageSize+spareSize);
            total -= (pSN->SPINand_PageSize-spareSize);
        }
        j++;
        blockNum++;
        if ((j >= block_count) || (total <= 0))
            break;
    }

    MSG_DEBUG("End Read_SPINand_Redunancy  total = %d\n", total);
    return 0;
}

void UXmodem_SPINAND()
{
    int i,offset=0, ret;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int len;
    PACK_CHILD_HEAD ppack;
    unsigned int volatile blockNum, total, block_cnt, totalblock;
    unsigned int volatile PA_Num, badBlock = 0;
    unsigned int ddrlen;
    unsigned int volatile offblk=0;
    unsigned int volatile page_count;

    MSG_DEBUG("\n SPI NAND flash...\n");
    /* Initial SPI NAND */
    spiNANDInit();

    MSG_DEBUG("pSN->SPINand_PageSize=%d\n",pSN->SPINand_PageSize);
    MSG_DEBUG("pSN->SPINand_PagePerBlock=%d\n",pSN->SPINand_PagePerBlock);

    memset((char *)&spinandImage, 0, sizeof(FW_SPINAND_IMAGE_T));
    pspiNandImage = (FW_SPINAND_IMAGE_T *)&spinandImage;

    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;
    while(1)
    {
        if(Bulk_Out_Transfer_Size>0)
        {
            usb_recv(ptr,sizeof(FW_SPINAND_IMAGE_T));
            memcpy(pspiNandImage, (unsigned char *)ptr, sizeof(FW_SPINAND_IMAGE_T));
            break;
        }
    }
    MSG_DEBUG("Action flag: %s, blockNo 0x%x(%d) len 0x%x(%d)\n", au8ActionFlagName[pspiNandImage->actionFlag],pspiNandImage->blockNo, pspiNandImage->blockNo, pspiNandImage->fileLength, pspiNandImage->fileLength);
    switch (pspiNandImage->actionFlag)
    {
    case WRITER_MODE:   // normal write
    {
        MSG_DEBUG("SPI NAND normal write !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        MSG_DEBUG("SPI NAND normal write2 !!!\n");
        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        if (pspiNandImage->imageType == UBOOT)   // system image
        {
            pspiNandImage->imageNo = 0;
            pspiNandImage->blockNo = 0;
            addMagicHeader(pspiNandImage->executeAddr, pspiNandImage->fileLength);
            addNUC980MagicHeader(0);
            ptr += IBR_HEADER_LEN;  // except the 32 bytes magic header
            offset = IBR_HEADER_LEN;
        }
        else
            offset = 0;

        len = pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize;
        MSG_DEBUG("SPI NAND normal BatchBurn_SPINAND !!! page_count=0x%x(%d)\n", len, len);
        MSG_DEBUG("\nimageNo=%d, blockNo=%d executeAddr=0x%x  fileLength=%d    len = %d\n", pspiNandImage->imageNo,pspiNandImage->blockNo, pspiNandImage->executeAddr, pspiNandImage->fileLength, len);
        if (pspiNandImage->imageType == UBOOT)     // system image
        {
            BatchBurn_SPINAND_BOOT(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,0,4,1);
            MSG_DEBUG("BatchBurn_SPINAND_BOOT(%d   ,0,4,1)\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize);
        }
        else
        {
            if(pspiNandImage->imageType!=IMAGE)
            {
                if(pspiNandImage->imageType == DATA_OOB)
                {
                    MSG_DEBUG("DATA_OOB type\n");
                    // ChipWriteWithOOB
                    //BatchBurn_SPINAND_Data_OOB(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSM->uPageSize),pspiNandImage->imageType);
                }
                else
                {
                    MSG_DEBUG("BatchBurn_SPINAND(0x%x,  0x%x,  0x%x)\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize), pspiNandImage->imageType);
                    BatchBurn_SPINAND(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSM->uPageSize),pspiNandImage->imageType);
                    MSG_DEBUG("BatchBurn_SPINAND(%d   %d   %d  )\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize), pspiNandImage->imageType);
                    MSG_DEBUG("BatchBurn_SPINAND offset = %d    ((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize  %d \n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSM->uPageSize), ((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize);
                }
            }
            else
            {
                MSG_DEBUG("_ch[0]=%c,_ch[1]=%c,_ch[2]=%c,_ch[3]=%c\n",(char)_ch[0],(char)_ch[1],(char)_ch[2],(char)_ch[3]);
                if(((char)_ch[0])=='U' && ((char)_ch[1])=='B' && ((char)_ch[2])=='I')
                {
                    BatchBurn_SPINAND(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize),UBIFS);
                }
                else
                {
                    MSG_DEBUG("BatchBurn_SPINAND(0x%x,  0x%x,  0x%x)\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize), YAFFS2);
                    BatchBurn_SPINAND(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize),YAFFS2);
                }
            }
        }
    }
    break;
    case MODIFY_MODE:   // modify
    {
        MSG_DEBUG("SPI NAND modify !!!\n");
    }
    break;

    case ERASE_MODE:    // erase
    {
        MSG_DEBUG("SPI NAND erase !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("\nstart=%d\n",pspiNandImage->blockNo); //start block
        MSG_DEBUG("length=%d\n",pspiNandImage->executeAddr); //block length
        MSG_DEBUG("type=%d, pspiNandImage->imageNo=0x%x\n",pspiNandImage->imageType, pspiNandImage->imageNo); //0: chip erase, 1: erase accord start and length blocks.
        MSG_DEBUG("imageNo=0x%08x\n",pspiNandImage->imageNo);
        MSG_DEBUG("SPINand_BlockPerFlash=0x%08x(%d)\n",pSN->SPINand_BlockPerFlash, pSN->SPINand_BlockPerFlash);
        MSG_DEBUG("SPINand_PagePerBlock=0x%08x(%d)\n",pSN->SPINand_PagePerBlock, pSN->SPINand_PagePerBlock);
        MSG_DEBUG("SPINand_PageSize=0x%08x(%d)\n",pSN->SPINand_PageSize, pSN->SPINand_PageSize);

