OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
        if(pspiNandImage->imageType==0)   //all chip erase
        {
            uint8_t volatile SR;
            usb_send((unsigned char*)&pSN->SPINand_BlockPerFlash,4);//send Erase block size to PC
            if (pspiNandImage->imageNo == 0xFFFFFFFF)
            {
                for(blockNum=0; blockNum < pSN->SPINand_BlockPerFlash; blockNum++)
                {
                    PA_Num = blockNum*pSN->SPINand_PagePerBlock;
                    if(spiNAND_bad_block_check(PA_Num) == 1)
                    {
                        badBlock++;
                        *_ack=blockNum;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        printf("bad_block:%d\n", blockNum);
                    }
                    else
                    {
                        spiNAND_BlockErase( (PA_Num>>8)&0xFF, PA_Num&0xFF);
                        SR = spiNAND_Check_Program_Erase_Fail_Flag();
                        if (SR != 0)
                        {
                            spiNANDMarkBadBlock(PA_Num);
                            badBlock++;
                            //*_ack=0xffff;
                            *_ack=blockNum;
                            usb_send((unsigned char*)_ack,4);//send ack to PC
                            printf("Error erase status! bad_block:%d\n", blockNum);
                        }
                        else
                        {
                            *_ack=blockNum;
                            usb_send((unsigned char*)_ack,4);//send ack to PC
                            MSG_DEBUG("BlockErase %d Done\n", blockNum);
                        }
                    }
                }
            }
#if(0)
            // ChipEraseWithBad - OOB
            else
            {
                // ChipEraseWithBad
                for(blockNum=0; blockNum < pSN->SPINand_BlockPerFlash; blockNum++)
                {
                    PA_Num = blockNum*pSN->SPINand_PagePerBlock;
                    spiNAND_BlockErase( (PA_Num>>8)&0xFF, PA_Num&0xFF);
                    SR = spiNAND_Check_Program_Erase_Fail_Flag();
                    if (SR != 0)
                    {
                        spiNANDMarkBadBlock(PA_Num);
                        //*_ack=0xffff;
                        *_ack=blockNum;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        printf("Error erase status! bad_block:%d\n", blockNum);
                    }
                    else
                    {
                        *_ack=blockNum;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        MSG_DEBUG("BlockErase %d Done\n", blockNum);
                    }
                }
            }
#endif
        }
        else     // Erase accord start and length blocks
        {
            uint8_t volatile SR;
            uint32_t volatile cnt = 0;
            usb_send((unsigned char*)&pspiNandImage->executeAddr,4);// send Erase block size to PC
            MSG_DEBUG("pspiNandImage->executeAddr = 0x%x   pspiNandImage->blockNo= %d\n",  pspiNandImage->executeAddr, pspiNandImage->blockNo);
            if (pspiNandImage->imageNo == 0xFFFFFFFF)
            {
                for(blockNum=pspiNandImage->blockNo; blockNum < (pspiNandImage->blockNo+pspiNandImage->executeAddr); blockNum++)
                {
                    cnt++;
                    PA_Num = blockNum*pSN->SPINand_PagePerBlock;

                    // if(blockNum == 0)
                    // spiNANDClearMarkBadBlock(PA_Num);
                    if(spiNAND_bad_block_check(PA_Num) == 1)
                    {
                        printf("bad_block:%d\n", blockNum);
                        badBlock++;
                        *_ack = blockNum /pspiNandImage->executeAddr;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        continue;
                    }
                    spiNAND_BlockErase( (PA_Num>>8)&0xFF, PA_Num&0xFF);
                    SR = spiNAND_Check_Program_Erase_Fail_Flag();
                    if (SR != 0)
                    {
                        printf("Error erase status! bad_block:%d\n", blockNum);
                        spiNANDMarkBadBlock(PA_Num);
                        badBlock++;
                        //*_ack=0xffff;
                        //*_ack=((cnt+1)*100) /pspiNandImage->executeAddr;
                        *_ack=((blockNum+1)*100) /((pspiNandImage->blockNo+pspiNandImage->executeAddr));
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                    }
                    else
                    {
                        /* send status */
                        //*_ack=((cnt+1)*100) /pspiNandImage->executeAddr;
                        *_ack=((blockNum+1)*100) /((pspiNandImage->blockNo+pspiNandImage->executeAddr));
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        MSG_DEBUG("blockNum = %d  cnt=%d\n", *_ack, cnt);
                    }
                }
            }
#if(0)
            // ChipEraseWithBad - OOB
            else
            {
                MSG_DEBUG("ChipEraseWithBad\n");
                for(blockNum=pspiNandImage->blockNo; blockNum < (pspiNandImage->blockNo+pspiNandImage->executeAddr); blockNum++)
                {
                    cnt++;
                    PA_Num = blockNum*pSN->SPINand_PagePerBlock;
                    spiNAND_BlockErase( (PA_Num>>8)&0xFF, PA_Num&0xFF);
                    SR = spiNAND_Check_Program_Erase_Fail_Flag();
                    if (SR != 0)
                    {
                        printf("Error erase status! bad_block:%d\n", blockNum);
                        //spiNANDMarkBadBlock(PA_Num);
                        badBlock++;
                        //*_ack=0xffff;
                        //*_ack=((cnt+1)*100) /pspiNandImage->executeAddr;
                        *_ack=((blockNum+1)*100) /((pspiNandImage->blockNo+pspiNandImage->executeAddr));
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        //continue;
                    }
                    else
                    {
                        /* send status */
                        //*_ack=((cnt+1)*100) /pspiNandImage->executeAddr;
                        *_ack=((blockNum+1)*100) /((pspiNandImage->blockNo+pspiNandImage->executeAddr));
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        MSG_DEBUG("blockNum = %d  cnt=%d\n", *_ack, cnt);
                    }
                }
            }
#endif
        }
    }
    break;

    case VERIFY_MODE:   // verify
    {
        MSG_DEBUG("SPI NAND normal verify !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        {
            if (pspiNandImage->imageType == UBOOT)     // system image
            {
                offblk=0;
                _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                ptr=_ch;
                PA_Num = pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
_retry3_:
                page_count = (PA_Num+offblk)*pSN->SPINand_PagePerBlock;
                while(spiNAND_bad_block_check(page_count) == 1)
                {
                    offblk++;
                    goto _retry3_;
                }
                MSG_DEBUG("offblk %d\n", offblk);
                Read_SPINand(DOWNLOAD_BASE,PA_Num+offblk,pspiNandImage->fileLength+IBR_HEADER_LEN+pspiNandImage->initSize);
                MSG_DEBUG("Read_SPINand   0x%x, 0x%x, 0x%x\n", DOWNLOAD_BASE, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk, pspiNandImage->fileLength+IBR_HEADER_LEN+pspiNandImage->initSize);

                memmove(_ch,_ch+IBR_HEADER_LEN+pspiNandImage->initSize,pspiNandImage->fileLength);
                MSG_DEBUG("memmove  0x%x, 0x%x, 0x%x\n", _ch, _ch+IBR_HEADER_LEN+pspiNandImage->initSize, pspiNandImage->fileLength);
                do
                {
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                }
                while((ptr-_ch)<(pspiNandImage->fileLength));
            }
            else
            {
                offblk=0;
                total=pspiNandImage->fileLength;
                do
                {
                    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                    ptr=_ch;
                    len=MIN(total,pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                    memset(ptr, 0xff, pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                    PA_Num = pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                    MSG_DEBUG("verify :%d   %d   %d \n", PA_Num+offblk, PA_Num, offblk);
_retry4_:
                    page_count = (PA_Num+offblk)*pSN->SPINand_PagePerBlock;
                    while(spiNAND_bad_block_check(page_count) == 1)
                    {
                        MSG_DEBUG("verify read bad_block:%d   %d  %d   %d \n", PA_Num+offblk, page_count, PA_Num, offblk);
                        offblk++;
                        goto _retry4_;
                    }
                    Read_SPINand(DOWNLOAD_BASE,PA_Num+offblk,len);
                    MSG_DEBUG("Read_SPINand(DOWNLOAD_BASE, %d, %d)\n\n", pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk,len);
                    do
                    {
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                        ptr += (*_ack);
                        MSG_DEBUG("read size=0x%08x\n",(unsigned int)(ptr-_ch));
                    }
                    while((int)(ptr-_ch)<len);
                    total-=len;
                    offblk+=1;
                    MSG_DEBUG("total=%d len=%d\n",total,len);
                }
                while(total!=0);
            }
        }
    }
    break;

